# ETL Processes
Use this notebook to develop the ETL process for each of your tables before completing the `etl.py` file to load the whole datasets.

In [1]:
import os
import glob
import psycopg2
import pandas as pd
from sql_queries import *

In [2]:
conn = psycopg2.connect("host=127.0.0.1 dbname=sparkifydb user=student password=student port=5556")
cur = conn.cursor()

In [3]:
def get_files(filepath):
    all_files = []
    for root, dirs, files in os.walk(filepath):
        files = glob.glob(os.path.join(root,'*.json'))
        for f in files :
            all_files.append(os.path.abspath(f))
    
    return all_files

# Process `song_data`
In this first part, you'll perform ETL on the first dataset, `song_data`, to create the `songs` and `artists` dimensional tables.

Let's perform ETL on a single song file and load a single record into each table to start.
- Use the `get_files` function provided above to get a list of all song JSON files in `data/song_data`
- Select the first song in this list
- Read the song file and view the data

In [4]:
song_files = get_files('data/song_data')

In [5]:
filepath = song_files[0]
print(filepath)

/Users/victoray/PycharmProjects/DataModelingProject/data/song_data/A/A/A/TRAAAEF128F4273421.json

In [6]:
df = pd.read_json(filepath, lines=True)
df.head()

,artist_id,artist_latitude,artist_location,artist_longitude,artist_name,duration,num_songs,song_id,title,year
0,AR7G5I41187FB4CE6C,NaN,"London, England",NaN,Adam Ant,233.40363,1,SONHOTT12A8C13493C,Something Girls,1982

## #1: `songs` Table
#### Extract Data for Songs Table
- Select columns for song ID, title, artist ID, year, and duration
- Use `df.values` to select just the values from the dataframe
- Index to select the first (only) record in the dataframe
- Convert the array to a list and set it to `song_data`

In [7]:
song_data = df[['song_id', 'title', 'artist_id', 'year', 'duration']]
song_data.values

array([['SONHOTT12A8C13493C', 'Something Girls', 'AR7G5I41187FB4CE6C',
        1982, 233.40363]], dtype=object)

#### Insert Record into Song Table
Implement the `song_table_insert` query in `sql_queries.py` and run the cell below to insert a record for this song into the `songs` table. Remember to run `create_tables.py` before running the cell below to ensure you've created/resetted the `songs` table in the sparkify database.

In [8]:
cur.execute(song_table_insert, song_data.values[0])
conn.commit()

UniqueViolation: duplicate key value violates unique constraint "songs_pkey"
DETAIL:  Key (song_id)=(SONHOTT12A8C13493C) already exists.

Run `test.ipynb` to see if you've successfully added a record to this table.

## #2: `artists` Table
#### Extract Data for Artists Table
- Select columns for artist ID, name, location, latitude, and longitude
- Use `df.values` to select just the values from the dataframe
- Index to select the first (only) record in the dataframe
- Convert the array to a list and set it to `artist_data`

In [9]:
artist_data = df[['artist_id', 'artist_name', 'artist_location', 'artist_latitude', 'artist_longitude']]
artist_data.columns = ['artist_id', 'name', 'location', 'latitude', 'longitude']
artist_data.values[0]

array(['AR7G5I41187FB4CE6C', 'Adam Ant', 'London, England', nan, nan],
      dtype=object)

#### Insert Record into Artist Table
Implement the `artist_table_insert` query in `sql_queries.py` and run the cell below to insert a record for this song's artist into the `artists` table. Remember to run `create_tables.py` before running the cell below to ensure you've created/resetted the `artists` table in the sparkify database.

In [12]:
cur.execute(artist_table_insert, artist_data.values[0])
conn.commit()

UniqueViolation: duplicate key value violates unique constraint "artists_pkey"
DETAIL:  Key (artist_id)=(AR7G5I41187FB4CE6C) already exists.

In [11]:
cur.execute('ROLLBACK')

Run `test.ipynb` to see if you've successfully added a record to this table.

# Process `log_data`
In this part, you'll perform ETL on the second dataset, `log_data`, to create the `time` and `users` dimensional tables, as well as the `songplays` fact table.

Let's perform ETL on a single log file and load a single record into each table.
- Use the `get_files` function provided above to get a list of all log JSON files in `data/log_data`
- Select the first log file in this list
- Read the log file and view the data

In [13]:
log_files = get_files('data/log_data')

In [14]:
filepath = log_files[0]

In [15]:
df = pd.read_json(filepath, lines=True)
df.head()

,artist,auth,firstName,gender,itemInSession,lastName,length,level,location,method,page,registration,sessionId,song,status,ts,userAgent,userId
0,Frumpies,Logged In,Anabelle,F,0,Simpson,134.47791,free,"Philadelphia-Camden-Wilmington, PA-NJ-DE-MD",PUT,NextSong,1.541044e+12,455,Fuck Kitty,200,1541903636796,"""Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4...",69
1,Kenny G with Peabo Bryson,Logged In,Anabelle,F,1,Simpson,264.75057,free,"Philadelphia-Camden-Wilmington, PA-NJ-DE-MD",PUT,NextSong,1.541044e+12,455,By The Time This Night Is Over,200,1541903770796,"""Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4...",69
2,Biffy Clyro,Logged In,Anabelle,F,2,Simpson,189.83138,free,"Philadelphia-Camden-Wilmington, PA-NJ-DE-MD",PUT,NextSong,1.541044e+12,455,God & Satan,200,1541904034796,"""Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4...",69
3,None,Logged In,Lily,F,0,Burns,NaN,free,"New York-Newark-Jersey City, NY-NJ-PA",GET,Home,1.540621e+12,456,None,200,1541910841796,"""Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebK...",32
4,HIM,Logged In,Lily,F,1,Burns,212.06159,free,"New York-Newark-Jersey City, NY-NJ-PA",PUT,NextSong,1.540621e+12,456,Beautiful,200,1541910973796,"""Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebK...",32

## #3: `time` Table
#### Extract Data for Time Table
- Filter records by `NextSong` action
- Convert the `ts` timestamp column to datetime
  - Hint: the current timestamp is in milliseconds
- Extract the timestamp, hour, day, week of year, month, year, and weekday from the `ts` column and set `time_data` to a list containing these values in order
  - Hint: use pandas' [`dt` attribute](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.dt.html) to access easily datetimelike properties.
- Specify labels for these columns and set to `column_labels`
- Create a dataframe, `time_df,` containing the time data for this file by combining `column_labels` and `time_data` into a dictionary and converting this into a dataframe

In [16]:
df = df[df['page'] == 'NextSong']
df.head()

,artist,auth,firstName,gender,itemInSession,lastName,length,level,location,method,page,registration,sessionId,song,status,ts,userAgent,userId
0,Frumpies,Logged In,Anabelle,F,0,Simpson,134.47791,free,"Philadelphia-Camden-Wilmington, PA-NJ-DE-MD",PUT,NextSong,1.541044e+12,455,Fuck Kitty,200,1541903636796,"""Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4...",69
1,Kenny G with Peabo Bryson,Logged In,Anabelle,F,1,Simpson,264.75057,free,"Philadelphia-Camden-Wilmington, PA-NJ-DE-MD",PUT,NextSong,1.541044e+12,455,By The Time This Night Is Over,200,1541903770796,"""Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4...",69
2,Biffy Clyro,Logged In,Anabelle,F,2,Simpson,189.83138,free,"Philadelphia-Camden-Wilmington, PA-NJ-DE-MD",PUT,NextSong,1.541044e+12,455,God & Satan,200,1541904034796,"""Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4...",69
4,HIM,Logged In,Lily,F,1,Burns,212.06159,free,"New York-Newark-Jersey City, NY-NJ-PA",PUT,NextSong,1.540621e+12,456,Beautiful,200,1541910973796,"""Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebK...",32
5,Matmos,Logged In,Joseph,M,0,Gutierrez,1449.11628,free,"Columbia, SC",PUT,NextSong,1.540809e+12,284,Supreme Balloon,200,1541911006796,"""Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_3...",75

In [17]:
df['start_time'] = pd.to_datetime(df['ts'])
df['hour'] = df['start_time'].dt.hour
df['day'] = df['start_time'].dt.day
df['week'] = df['start_time'].dt.week
df['month'] = df['start_time'].dt.month
df['year'] = df['start_time'].dt.year
df['weekday'] = df['start_time'].dt.weekday_name
t = df[['start_time', 'hour', 'day', 'week', 'month', 'year', 'weekday']]
t.head()

                     start_time  hour  day  week  month  year   weekday
0 1970-01-01 00:25:41.903636796     0    1     1      1  1970  Thursday
1 1970-01-01 00:25:41.903770796     0    1     1      1  1970  Thursday
2 1970-01-01 00:25:41.904034796     0    1     1      1  1970  Thursday
4 1970-01-01 00:25:41.910973796     0    1     1      1  1970  Thursday
5 1970-01-01 00:25:41.911006796     0    1     1      1  1970  Thursday

In [18]:
time_data = ()
column_labels = ()

In [19]:
time_df = t
time_df.head()

                     start_time  hour  day  week  month  year   weekday
0 1970-01-01 00:25:41.903636796     0    1     1      1  1970  Thursday
1 1970-01-01 00:25:41.903770796     0    1     1      1  1970  Thursday
2 1970-01-01 00:25:41.904034796     0    1     1      1  1970  Thursday
4 1970-01-01 00:25:41.910973796     0    1     1      1  1970  Thursday
5 1970-01-01 00:25:41.911006796     0    1     1      1  1970  Thursday

In [28]:
cur.execute('ROLLBACK')

#### Insert Records into Time Table
Implement the `time_table_insert` query in `sql_queries.py` and run the cell below to insert records for the timestamps in this log file into the `time` table. Remember to run `create_tables.py` before running the cell below to ensure you've created/resetted the `time` table in the sparkify database.

In [22]:
for i, row in time_df.iterrows():
    try:
        cur.execute(time_table_insert, list(row))
        conn.commit()
    except:
        cur.execute('ROLLBACK')

Run `test.ipynb` to see if you've successfully added records to this table.

## #4: `users` Table
#### Extract Data for Users Table
- Select columns for user ID, first name, last name, gender and level and set to `user_df`

In [23]:
user_df = df[['userId', 'firstName', 'lastName', 'gender', 'level']]
user_df.columns = ['user_id', 'first_name', 'last_name', 'gender', 'level']
user_df.head()

  user_id first_name  last_name gender level
0      69   Anabelle    Simpson      F  free
1      69   Anabelle    Simpson      F  free
2      69   Anabelle    Simpson      F  free
4      32       Lily      Burns      F  free
5      75     Joseph  Gutierrez      M  free

#### Insert Records into Users Table
Implement the `user_table_insert` query in `sql_queries.py` and run the cell below to insert records for the users in this log file into the `users` table. Remember to run `create_tables.py` before running the cell below to ensure you've created/resetted the `users` table in the sparkify database.

In [24]:
for i, row in user_df.iterrows():
    cur.execute(user_table_insert, row)
    conn.commit()

Run `test.ipynb` to see if you've successfully added records to this table.

## #5: `songplays` Table
#### Extract Data and Songplays Table
This one is a little more complicated since information from the songs table, artists table, and original log file are all needed for the `songplays` table. Since the log file does not specify an ID for either the song or the artist, you'll need to get the song ID and artist ID by querying the songs and artists tables to find matches based on song title, artist name, and song duration time.
- Implement the `song_select` query in `sql_queries.py` to find the song ID and artist ID based on the title, artist name, and duration of a song.
- Select the timestamp, user ID, level, song ID, artist ID, session ID, location, and user agent and set to `songplay_data`

#### Insert Records into Songplays Table
- Implement the `songplay_table_insert` query and run the cell below to insert records for the songplay actions in this log file into the `songplays` table. Remember to run `create_tables.py` before running the cell below to ensure you've created/resetted the `songplays` table in the sparkify database.

In [32]:
for index, row in df.iterrows():

    # get songid and artistid from song and artist tables
    print((row.song, row.artist, row.length))
    cur.execute(song_select, (row.song, row.artist, row.length))
    results = cur.fetchone()
    
    if results:
        print('results', results)
        songid, artistid = results
    else:
        songid, artistid = 'None', 'None'

    # insert songplay record
    songplay_data = (row.start_time, row.userId, row.level, songid, artistid,
                         row.sessionId,
                         row.location, row.userAgent)
    cur.execute(songplay_table_insert, songplay_data)
    conn.commit()

('Fuck Kitty', 'Frumpies', 134.47791)
('By The Time This Night Is Over', 'Kenny G with Peabo Bryson', 264.75057)
('God & Satan', 'Biffy Clyro', 189.83138)
('Beautiful', 'HIM', 212.06159)
('Supreme Balloon', 'Matmos', 1449.11628)
('The One', 'Gary Allan', 259.83955)
('Five Roses', 'Miracle Fortress', 200.9073)
('Cuentale', 'Don Omar', 261.35465)
("D'Evils", 'Jay-Z', 212.27057)
('Easily (Album Version)', 'Red Hot Chili Peppers', 231.33995)
('Rebels of the Sacred Heart', 'Flogging Molly', 361.9522)
('Now_ Right Now', 'Reverend Horton Heat', 158.64118)
('I Made A Resolution', 'Sea Wolf', 232.61995)
('Lucky (Album Version)', 'Jason Mraz & Colbie Caillat', 189.6224)
('Enough\x19s Enough', 'Jamie Lidell', 175.25506)
('Mushaboom (Postal Service Mix)', 'Feist', 212.79302)
("We're Going Out Tonight", 'Sex Slaves', 175.51628)
('To Them These Streets Belong', 'Rise Against', 169.482)
('Get Me Bodied', 'BeyoncÃ\x83Â©', 359.54893)
('Never Leave Me Alone', 'Nate Dogg', 356.38812)
('Love Story', 'Taylor Swift', 233.89995)
('Sweet home Alabama', 'Lynyrd Skynyrd', 216.60689)
('Caught Out There (Explicit)', 'Kelis', 293.58975)
('Last Day Of Magic', 'The Kills', 203.38893)
('What A Feeling', 'Collie Buddz featuring Paul Wall', 271.62077)
('Fireflies', 'Charttraxx Karaoke', 225.17506)
('The Funeral (Album Version)', 'Band Of Horses', 321.14893)
('Clocks', 'Coldplay', 307.51302)
('Have A Nice Day', 'Bon Jovi', 228.75383)
('Alive (2006 Remastered Album Version)', 'P.O.D.', 203.7024)
('Plans (Replanned by Mogwai)', 'Bloc Party', 222.04036)
('Pa Pa Pa', 'Los Prisioneros', 211.12118)
('Lots More Stairs', 'Octopus Project', 175.25506)
('Ecoute Ce Scratch', 'Roudoudou', 18.41587)
('Tierra Tradicional', 'Africando', 253.54404)
('Simmons Incorporated', 'RUN-DMC Featuring Method Man_ Kenny Cash_ Mike Ransom_ and Jamel Simmons', 266.52689)
("I'm Goin' Away", 'Graham Coxon', 197.14567)
('In The Fade', 'Queens Of The Stone Age', 231.02649)
('Strawberry AndrÃ\x83Â© (Album Version)', 'Dance Gavin Dance', 193.30567)
('Eyes As Candles', 'Passion Pit', 243.69587)
("Let's Get It Started", 'Black Eyed Peas', 229.61587)
('Ca plane pour moi', 'Plastic Bertrand', 180.00934)
('Strange Brew', 'Cream', 166.5824)
('A Message', 'Coldplay', 284.39465)
('Sweat the Battle Before the Battle Sweats You (Album Version)', 'Cute Is What We Aim For', 172.22485)
('Of Wolf And Man', 'Metallica', 256.9922)
('Tape Song', 'The Kills', 217.70404)
('The Pretender', 'Foo Fighters', 271.38567)
('Eyen [Chosen by fans on Warp20.net]', 'Plaid', 260.96281)
("It's New To Me", 'The Van Pelt', 208.71791)
('Make You Smile', '+44', 224.57424)
('I May Never Find', 'Chris Brown', 275.1473)
('Black Horse And The Cherry Tree (Radio Version)', 'KT Tunstall', 170.47465)
('Kids In America', 'Cascada', 184.39791)
('Black Heart Inertia', 'Incubus', 293.38077)
('Black & Blue', 'Miike Snow', 220.83873)
('Sala De RecepÃ\x83Â§Ã\x83Â£o', 'Cartola', 208.92689)
('Commander In Thief', 'Kill The Client', 70.68689)
('Woman', 'Wolfmother', 175.82975)
('Wagon Wheel', 'Old Crow Medicine Show', 231.73179)
('Debbie', 'Architecture In Helsinki', 173.73995)
("I Think I'll Live", 'Charlie Louvin', 170.86649)
('La Derrota de Un Don Juan', 'Miguel Morales', 270.78485)
('Le Courage Des Oiseaux', 'Dominique A', 153.20771)
('Run With The Blind', 'Cock Sparrer', 203.25832)
('I Love You So Much It Hurts', 'Jimmy Wakely', 165.74649)
('A Little Death Around the Eyes', 'Peter Doherty', 217.02485)
('Thinking Of You', 'Katy Perry', 246.41261)
('You Love Me Anyway (Album)', 'Sidewalk Prophets', 260.62322)
('Torches', 'Rise Against', 221.17832)
("Wavin'  Flag", "K'Naan", 220.49914)
('Holiday', 'Patrick Jumpen', 208.87465)
('Empire State Of Mind (Part II) Broken Down', 'Alicia Keys', 216.47628)

Run `test.ipynb` to see if you've successfully added records to this table.

# Close Connection to Sparkify Database

In [ ]:
conn.close()

# Implement `etl.py`
Use what you've completed in this notebook to implement `etl.py`.